---
kind: other
id: Methods.T:Autodesk.Revit.DB.SpatialElementGeometryCalculator
source: html/049425a9-60ad-a71a-1f51-5b4ed233734d.htm
---
# SpatialElementGeometryCalculator Methods

Compute the spatial element geometry and returns the boundary face information.